{
  "Administration_and_Librarians": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n Governance and Administration: Learn about the University's governance structure, including the Board of Governors, Senate, and Convocation, which oversee academic and administrative decisions. Meet the University's leadership team, including the Chancellor, Principal, and Vice-Principal Academic. Discover the University's history and notable alumni and faculty members.",
  "Admission": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\nApply to Bishop's University: Learn about the application procedure, deadlines, and requirements for undergraduate and graduate programs, including admission policies, application forms, and supporting documents.\n\nAdmission Requirements: Explore the specific admission requirements for different types of applicants, including high school, CEGEP, international, and mature students, as well as transfer students and second-degree applicants.\n\nProgram-Specific Admission: Find information on admission requirements for specific programs, including the Bachelor of Education, Master of Arts in Education, and Master of Education, as well as the application process and deadlines for these programs.",
  "Continuing_Education": "Here's a 3-sentence summary for the navigation menu:\n\n- Transfer Credit: Eligible for advance credit upon admission with official transcripts and course descriptions.\n- Continuing Education: Offers credit and non-credit courses for adult learners through the Lennoxville campus and online.\n- English Writing Proficiency: Required for all bachelor degree students, can be satisfied by passing the EWP Exam or the English Writing Proficiency course EWP099.",
  "Division_of_Humanities_Arts_Administration": "Here is a summary of the Arts Administration section in 3 sentences for a navigation menu:\n\nArts Administration: Explore the business and organizational aspects of the cultural sector through our interdisciplinary program, combining study of business, creative arts, and public culture. Choose from concentrations in Drama, Fine Arts, Film Studies, Music, or Public History, and gain hands-on experience through practicum courses. Students can also pursue a Certificate in Arts Management or a double-degree option with a Business program.",
  "Division_of_Humanities_Art_History": "Here is a summary of the academic calendar section for the Art History program at Bishop's University in 3 sentences:\n\n**Art History Program**\n\nExplore the world of art and culture through our Art History program, which offers Minor, Major, and Honours programs. Students can choose from a variety of courses, including period-based, thematic, and theory-based courses, as well as studio arts and electives. With a focus on critical thinking, analysis, and effective communication, our program prepares students for careers in the arts, museums, and cultural institutions.",
  "Division_of_Humanities_Classical_Studies": "Here is a summary of the academic calendar section for the Classical Studies and Drama departments in 3 sentences for use in a navigation menu:\n\n**Classical Studies**\nExplore the ancient Mediterranean world through courses in Classical Studies, including language, literature, history, culture, art, and archaeology. Choose from a range of programs, including Honours, Major, and Minor options, as well as courses in Greek and Latin languages. Discover the classical tradition and its enduring influence on Western culture.\n\n**Drama**\nDevelop your skills in acting, directing, playwriting, and technical theatre through the Drama department's programs. Choose from a range of courses, including dramatic literature and theatre history, performance and production, and technical theatre. Pursue a Major or Minor in Drama, or explore the intersection of drama and other disciplines through cognate courses.",
  "Division_of_Humanities_College_of_Liberal_Arts": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\nLiberal Arts Program: Explore the Liberal Arts Program, including courses, requirements, and programs such as the Honours degree, Minor in Social Justice and Citizenship, and Liberal Arts Foundation Courses.\n\nCourses: Browse through various courses offered in the Liberal Arts Program, including Liberal Arts Foundation Courses, Thematic Seminar Courses, and Language and Culture Courses.\n\nPrograms and Requirements: Learn about the requirements for the Liberal Arts Major and Minor, including language requirements, social sciences and natural sciences/mathematics requirements, and humanities breadth/depth requirements.",
  "Division_of_Humanities_Drama": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- **Production Courses**: Explore hands-on production experiences in acting, stage management, directing, and technical production in Studio and Centennial Theatres.\n- **Thesis and Independent Study**: Undertake a thesis project or pursue advanced independent study options in theatre research, performance, production, and special projects.\n- **Drama Courses**: Discover advanced courses in playwriting, costume design, set, lighting, and sound design, as well as special projects and independent studies.",
  "Division_of_Humanities_English": "Here is a summary of the academic calendar section for the English Department at Bishop's University in 3 sentences:\n\n**English Department Academic Calendar**\n\nThe English Department at Bishop's University offers a range of undergraduate programs, including Honours, Majors, and Minors in English, Film and Media Studies, and Creative Writing and Journalism. Students can choose from various concentrations, such as Literature, Film and Media Studies, and Creative Writing, and can also pursue double majors or program combinations. The department's courses cover a wide range of topics, from literary theory and criticism to creative writing and screenwriting, and provide students with a solid foundation in critical thinking, writing, and communication skills.",
  "Division_of_Humanities_English_Language_Studies": "Here is a summary of the English Language Studies section in 3 sentences for a navigation menu:\n\n**English Language Studies**\n\n* Explore courses in composition, oral expression, and English as a second language to improve your understanding of English language and communication.\n* Choose from a variety of courses, including Effective Writing, Intermediate English as a Second Language, and English Grammar, to suit your language level and needs.\n* Pursue a Minor in English Language Studies, a Certificate of Proficiency in English as a Second Language, or a Major in Modern Languages with an English Language Studies component.",
  "Division_of_Humanities_Etudes_francaises_et_quebecoises": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n- **French Language Courses**: Explore our French language courses, from beginner to advanced levels, including FRE and FRA courses that cater to non-francophone and francophone students.\n- **Programs and Minors**: Discover our programs and minors in French, including Honours, Majors, and Minors in French as a Second Language, Études françaises et québécoises, and more.\n- **Yearly Progression**: View our yearly progression for students in a Major or Minor, including course requirements and recommendations for each level, from Level 1 - Beginners to Level 5 - Advanced.",
  "Division_of_Humanities_EWP": "Here is a summary of the academic calendar section for the French program at Bishop's University in 3 sentences:\n\n**French Program**\n\nExplore the French language and culture through various courses, from beginner to advanced levels, including grammar, conversation, literature, and linguistics. Choose from a range of courses, such as French III, French IV, Atelier de conversation multiniveau, and Culture and Society. Non-francophone students must have completed FRE 141 or its equivalent to take courses at Levels 4 and 5, while francophone students have no prerequisites unless specified.",
  "Division_of_Humanities_Fine_Arts": "Here is a summary of the Fine Arts program at Bishop's University in 3 sentences for a navigation menu:\n\n- **Fine Arts Program Overview**: Explore the mission and goals of the Department of Fine Arts, which aims to produce independent, critical thinkers who can discover and synthesize diverse types of knowledge.\n- **Programs and Courses**: Discover the various programs offered, including the Major in Fine Arts, Studio Honours, Double Major in Secondary Education and Fine Arts, Minor in Fine Arts, and Certificate in Studio Arts, as well as the course descriptions for Studio, Art History, and Comparative Arts courses.\n- **Course Requirements**: Learn about the course requirements for each program, including the Studio, Art History, and Comparative Arts components, as well as the prerequisites and cognates for each course.",
  "Division_of_Humanities_History": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n**History Department**\n\nExplore the study of history, a discipline that promotes critical thinking, cultural awareness, and global understanding. Our programs offer a range of courses, from introductory to advanced, covering topics such as global history, national histories, and thematic studies. From Honours to Minor programs, we offer flexible and engaging options for students to develop their historical knowledge and skills.",
  "Division_of_Humanities_Modern_Languages_German": "Here is a summary of the German Studies section in 3 sentences:\n\n**German Studies**\n\n* Explore German language, literature, and culture through various courses, including language courses, literature and cinema courses, and civilization courses.\n* Choose from a range of courses, such as GER 235: Gods and Heroes, Devils and Witches: Introduction to German Literature and Culture, or GER 270: Introduction to German Film.\n* Consider pursuing a degree or certificate in German Studies, or take individual courses as free electives or part of the Humanities Divisional Requirement.",
  "Division_of_Humanities_Modern_Languages_Hispanic_Studies": "Here is a summary of the Hispanic Studies section in 3 sentences for a navigation menu:\n\n- Explore our programs: Honours in Hispanic Studies, Major in Hispanic Studies, Concentration in Hispanic Studies, Double Major French/Spanish and Education, Minor in Hispanic Studies, and Certificate in Hispanic Studies.\n- Discover our courses: Language, Civilization and Culture, Literature, and Linguistics courses, including Spanish Language I-IV, Language and Cultures in Practice I-II, and Advanced Spanish: Topics and Texts I-II.\n- Learn more about our requirements: Prerequisites, course descriptions, and program requirements for each program and course.",
  "Division_of_Humanities_Modern_Languages_Italian": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- **Seminars**: Explore advanced research methods and complete an Honours Thesis in Hispanic Studies with courses like SPA 443 and SPA 444.\n- **Independent Studies**: Pursue individual study projects in Spanish linguistics, literature, or civilization with courses like SPA 315 and SPA 316.\n- **Italian Studies**: Learn Italian language and culture with courses like ITA 100, ITA 201, and ITA 235, or explore Italian literature and cinema with courses like ITA 384 and ITA 309.",
  "Division_of_Humanities_Modern_Languages_Japanese": "Here's a summary of the Japanese Studies section in 3 sentences for a navigation menu:\n\n- Japanese Studies: Explore Japanese language and culture through various courses and programs, including a Major and Minor in Japanese Studies.\n- Courses: Browse Japanese language courses, such as Introduction to Japanese Language I-II, Intermediate Japanese Language I-II, and Advanced Japanese Language I-II.\n- Programs: Discover opportunities for exchange programs, internships, and independent studies in Japan, as well as a Minor in Japanese Studies and a Major in Modern Languages with a Japanese Studies concentration.",
  "Division_of_Humanities_Modern_Languages_Literatures_and_Cultures": "Here's a 3-sentence summary for the navigation menu:\n\n- Modern Languages, Literatures and Cultures: Explore interdisciplinary themes through independent studies (LIB 230-233) and choose from a list of elective courses that cover topics such as multicultural education, environmental policy, and social movements.\n- Elective Course List: Select from 25 courses across various departments, including education, English, environmental studies, history, philosophy, sociology, and women's studies.\n- Program Overview: The department offers Honours and Major programs in Hispanic Studies, Modern Languages, and International Majors in German, as well as Concentrations/Minors in German Studies, Hispanic Studies, and Japanese Studies.",
  "Division_of_Humanities_Music": "Here is a summary of the academic calendar section for the Music program in 3 sentences for use in a navigation menu:\n\n- Explore Music Majors: Learn about the requirements for the Major in Music - Classical, Major in Popular Music Studies, and Minor in Music - Classical and Minor in Popular Music Studies.\n- Browse Music Courses: Discover a wide range of courses in Music Theory and Composition, Music Literature, Music History, and Ensemble.\n- Find Practical Study Opportunities: Learn about individual practical study courses, including principal instrument performance and ensemble courses, and how to register for them.",
  "Division_of_Humanities_Overview": "Here's a 3-sentence summary for the navigation menu:\n\n- Division of Humanities: Offers a wide range of liberal arts disciplines, interdisciplinary programs, and creative arts programs, leading to Bachelor of Arts (B.A.) degrees.\n- Academic Requirements: Majors and honours students must complete at least three credits in four categories, including languages, drama, classics, and natural science.\n- Programs and Degrees: The Division offers various programs, including Divisional Majors, honours programs, and minor programs, with specific requirements and course listings found under individual departments.",
  "Division_of_Humanities_Philosophy": "Here is a summary of the Philosophy section in 3 sentences for a navigation menu:\n\nPhilosophy Courses: Explore the Western Philosophical Tradition, Continental European Philosophy, and Problems, Special Interests and Service Courses, including Honours and Majors programs, Minors, and Independent Studies. Discover courses on Ancient Philosophy, Medieval Philosophy, Modern Philosophy, and more, covering topics such as Ethics, Metaphysics, and the Philosophy of Mind. From introductory courses like On the Way to the Good Life to advanced seminars like Topics in Existentialism and Phenomenology, there's something for every philosophy student.",
  "Division_of_Humanities_Pre_Law": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- Explore Philosophy courses at Bishop's University, including topics in Philosophy of Language, Film, Art, Literature, and more.\n- Discover Pre-Law programs, including a minor and certificate, designed to ground students in theoretical underpinnings of law-making and interpretation.\n- View a list of courses for the Pre-Law program, categorized by Logical and Analytical Reasoning, Reading and Writing, and more.",
  "Division_of_Humanities_Religion": "Here is a summary of the academic calendar section for the Religion department in 3 sentences:\n\n**Religion Department**\n\nStudy the world's major religions and their impact on human life, from biblical studies to world religions and philosophy. Choose from a range of courses, including Honours, Major, and Minor programs, as well as independent studies and cognate courses. Explore topics such as biblical studies, world religions, approaches and perspectives, and philosophy of religion, with a focus on critical thinking, analysis, and interpretation.",
  "Division_of_Natural_Sciences_and_Mathematics_Biochemistry": "Here is a summary of the academic calendar section for the navigation menu in 3 sentences:\n\n- Biochemistry Program: Offers Honours, Major, and Minor degrees with a strong background in chemistry, biochemistry, and biology.\n- Program Requirements: Vary by degree type, but include core required courses, required optional courses, and free electives.\n- Course Descriptions: Available for individual courses, including BCH 101 Introduction to Nutrition, BCH 210 General Biochemistry, and BCH 311 Proteins.",
  "Division_of_Natural_Sciences_and_Mathematics_Biological_Sciences": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n\"Biological Sciences: Explore the Biology programs at Bishop's University, including Bachelors of Science (B.Sc.) and Bachelors of Arts (B.A.) degrees in Biology, with concentrations in Health Science and Biodiversity and Ecology. Discover the faculty, program overview, and course requirements for each program. Learn about the various courses offered in the Department of Biological Sciences, including introductory, core, and elective courses.\"",
  "Division_of_Natural_Sciences_and_Mathematics_Chemistry": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n**Chemistry Courses**\n\nExplore our comprehensive range of chemistry courses, from introductory general chemistry to advanced topics in organic chemistry, physical chemistry, and analytical chemistry. Our courses cater to various interests and career paths, including industrial employment, graduate studies, and research projects. From brewing science to scientific writing, our courses provide hands-on experience and in-depth knowledge in the field of chemistry.",
  "Division_of_Natural_Sciences_and_Mathematics_Computer_Science": "Here is a summary of the Computer Science academic calendar section in 3 sentences for use in a navigation menu:\n\nComputer Science Programs\n- Explore undergraduate and graduate degree options, including Honours, Major, and Minor programs\n- Discover certificate programs and co-op opportunities to gain practical experience\n- Learn about course offerings, including introductory and advanced courses in computer science, software engineering, and more",
  "Division_of_Natural_Sciences_and_Mathematics_Mathematics": "Here is a summary of the academic calendar section for the navigation menu in 3 sentences:\n\nMathematics Courses: Explore a wide range of mathematics courses, including Calculus, Discrete Mathematics, Linear Algebra, and more, with various levels of specialization available for Honours, Major, and Minor programs.\n\nCourse List: Browse through the list of mathematics courses, including introductory courses like MAT 100 and MAT 101, and advanced courses like MAT 315 and MAT 316, as well as electives and cognate courses.\n\nPrograms: Discover the various mathematics programs offered, including Mathematics Honours, Mathematics Major, Mathematics Minor, and Mathematical Contexts Minor, each with its own set of requirements and course options.",
  "Division_of_Natural_Sciences_and_Mathematics_Overview": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- Division of Natural Sciences and Mathematics: Explore our diverse range of courses, programs, and degrees in Biochemistry, Biological Sciences, Chemistry, Computer Science, Environmental Science, Mathematics, and Physics and Astronomy.\n- Programs and Degrees: Discover our Bachelor of Science (B.Sc.) and Bachelor of Arts (B.A) degrees with Honours or Majors specialization, as well as our Master of Science (M.Sc.) degrees and certificate programs.\n- Course Information: Find information on our collegial-equivalent science courses, advanced placement, and arts and science requirements to help you plan your academic path.",
  "Division_of_Natural_Sciences_and_Mathematics_Physics_and_Astronomy": "Here is a summary of the academic calendar section for the Physics and Astronomy department at Bishop's University in 3 sentences:\n\n**Physics and Astronomy Department**\n\n* Explore undergraduate and graduate programs in Physics, including Honours, Major, and Minor degrees, as well as research opportunities and course offerings.\n* Discover a range of courses, from introductory physics and astronomy to advanced topics in quantum mechanics, relativity, and statistical mechanics.\n* Learn from a team of experienced faculty members and engage in hands-on research and laboratory experiences to develop your skills and knowledge in the field of physics and astronomy.",
  "Division_of_Natural_Sciences_and_Mathematics_Pre_Medicine_Double_Major": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- Explore Physics courses: Numerical Methods and Simulations (PHY 475), Stellar Astrophysics (PHY 476), and Honours Research Dissertation (PHY 480).\n- Learn about the Pre-Medicine Double Major (B.Sc.) program, which allows students to complete pre-requisites for medical schools while pursuing a liberal arts education.\n- Discover the program requirements, including Year 1 courses, Pre-Medicine Required Courses, Pre-Medicine Required Options, and Free Electives.",
  "Division_of_Social_Sciences_Economics": "Here is a summary of the academic calendar section for the Economics program in 3 sentences that can be used in a navigation menu:\n\n**Economics Program**\nExplore the undergraduate and graduate programs in Economics, including Honours, Major, Minor, and joint programs with Political Studies. Discover the various concentrations in Business Economics, Public Policy, and Global Economy, as well as the requirements for each program. Browse the list of courses offered in the Economics department, including introductory and advanced courses in microeconomics, macroeconomics, and econometrics.",
  "Division_of_Social_Sciences_Environment_and_Geography": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n\"Environment and Geography Programs: Explore undergraduate and graduate programs in Environmental Studies, Geography, and Sustainable Agriculture and Food Systems, including majors, minors, and certificate programs. Discover course offerings in topics such as climate change, environmental policy, sustainable agriculture, and food systems. Learn about research opportunities and experiential learning projects in the Department of Environment and Geography.\"",
  "Division_of_Social_Sciences_Overview": "Here's a 3-sentence summary of the Division of Social Sciences section for a navigation menu:\n\n\"Division of Social Sciences: Explore our wide range of courses and programs in Economics, Environment and Geography, Politics and International Studies, Psychology, Sociology, and Sports Studies. Discover our degree and program options, including Majors, Honours, Minors, and certificate programs. Learn about our requirements, transfer policies, and graduation distinctions, including the option to graduate 'with Distinction'.\"",
  "Division_of_Social_Sciences_Political_Science": "Here is a summary of the academic calendar section for the Politics and International Studies department in 3 sentences that can be used in a navigation menu:\n\n\"Politics and International Studies: Explore our undergraduate programs in Political Studies, International Studies, and International Political Economy, including Honours, Major, and Minor options. Discover our course offerings in Canadian Politics, International Relations, and Global Governance. Learn from our experienced faculty and engage in research, internships, and study abroad opportunities.\"",
  "Division_of_Social_Sciences_Psychology": "Here is a summary of the Politics and International Studies section in 3 sentences for a navigation menu:\n\n- **Politics and International Studies**: Explore the various aspects of politics and international relations, including Canadian politics, international relations, comparative politics, and more.\n- **Undergraduate Courses**: Choose from a range of courses, such as POL 318: Elections, Parties and Voters in Canada, POL 140: Introduction to International Relations, and POL 230: The Politics of Sport.\n- **Honours and Advanced Courses**: Pursue advanced studies in politics and international relations with courses like POL 431: The American Welfare State, POL 436: Comparative Politics: A World of Regions, and POL 443: Honours Seminar on Peacekeeping.",
  "Division_of_Social_Sciences_Sociology": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n- **Undergraduate Programs**: Explore our undergraduate programs in Psychology, including B.A., B.Sc., and Honours options, as well as minors in Psychology and Mindfulness and Contemplative Studies.\n- **Certificate Programs**: Discover our certificate programs, including the Certificate in Human Psychology, designed for adult students and professionals.\n- **Course List**: Browse our comprehensive list of Psychology courses, including introductory courses, core courses, and specialized courses in areas like abnormal psychology, cognitive psychology, and neuropsychology.",
  "Division_of_Social_Sciences_Sports_Studies": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n**Psychology Courses**\n\nExplore the Department of Psychology's course offerings, including introductory courses, electives, and advanced seminars in areas such as clinical psychology, research methods, and statistics. Discover courses that align with your interests, from the Psychology of Death and Dying to Multivariate Statistics. Browse our course catalog to find the perfect fit for your academic journey.",
  "Faculty_and_Divisional_Programs": "❌ llama-3.1-8b-instant failed: Can you clarify your question",
  "Fees": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n- Payment Deadlines: Pay School Fees in full by September 30 for Fall Semester and January 31 for Winter Semester.\n- Fees: Tuition fees vary by residency and program, with compulsory fees including registration, administration, and student services fees.\n- Payment Methods: Fees can be paid by cheque, online banking, debit card, or cash, with international students able to use flywire for payment transfer.",
  "General_Information": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- Undergraduate programs: Bishop's University offers Bachelor's degrees in Arts, Science, Education, and Business Administration with various specialization options.\n- Academic organization: The university has a single faculty with three areas: Arts and Science, the Williams School of Business, and the School of Education.\n- Part-time studies: Bishop's University offers part-time degree and certificate studies for adult learners through its part-time studies program.",
  "Graduate_Certificate_in_Brewing_Science": "Here's a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\nEducation\n- Explore educational leadership, teaching, and learning with courses like GSE 571 Principles of Educational Leadership and GSE 582 Teaching ESL to Adults.\n- Discover topics such as school-based management, invitational leadership, and professional collaboration in educational leadership courses.\n- Develop your skills in teaching English as a second language with courses like GSE 585 Methods in Second Language Teaching I and GSE 589 Observation and Practice Teaching in Second Language Classrooms.",
  "Graduate_Certificate_in_Business": "Here's a summary of the Graduate Certificate in Business program in 3 sentences for a navigation menu:\n\n- Graduate Certificate in Business: Develop business skills and build a professional network in a 15-credit online program.\n- Program Overview: Designed for non-business graduates, this program helps you understand the workplace, build a skill set, and prepare for entry into the workforce.\n- Program Structure: The program is delivered online, part-time, and consists of five 3-credit courses, which can be completed within a year or over a longer period.",
  "Graduate_Certificate_in_Knowledge_Mobilization": "Here's a summary of the academic calendar section in 3 sentences for navigation menu:\n\n- **Course Structure**: The Master of Education program consists of 45 credits, with 9 compulsory credits in Foundations courses and 30 credits in Elective courses.\n- **Foundations Courses**: Students must complete 9 compulsory credits, 3 credits from each of the 3 themes: Society, Culture, and Politics, Language, Literacy, and Learning, and Educational Practice and Leadership.\n- **Elective Courses**: Students can choose 30 credits from any of the 3 themes, with more detailed information available from the School of Education.",
  "Graduate_Certificate_in_Teaching_Intensive_English": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- **Educational Research and Practice**: Explore the relationship between educational research, knowledge, and practice, and develop an inquiry stance towards teaching.\n- **Special Education and Inclusive Education**: Examine recent developments in special education, characteristics of learners with diverse special needs, and approaches to facilitating learning for individuals with exceptionalities.\n- **Educational Technology and Leadership**: Investigate the role of technology in education, policy analysis, and educational leadership, and develop skills in conducting research and creating student-centered applications of technology.",
  "Graduate_Micro_Program_in_Climate_Change": "Here's a summary of the academic calendar section in 3 sentences for the navigation menu:\n\n- **Master of Education (M.Ed.) Program**: Complete compulsory courses and specific ones depending on the program, with the option to transfer up to 9 credits from other institutions or programs.\n- **Course Offerings**: Graduate courses are normally offered in four sessions: Fall, Winter, Spring, and Summer, with a maximum of 9 credits transferable from other institutions or programs.\n- **Master of Arts (M.A.) in Education: Leadership, Societies, and Languages**: A 45-credit program with a thesis option, consisting of a research module, foundations courses, and a thesis proposal.",
  "Graduate_Studies": "Based on the provided context, here is a possible navigation menu for the academic calendar section:\n\n**Sociology Program**\n\n* Major in Sociology (48 credits)\n* Honours in Sociology (61 credits)\n* Concentrations:\n\t+ Criminology, Law and Social Policy\n\t+ Gender, Diversity and Equity Studies\n\t+ Family, Health and Community\n* Minors:\n\t+ Sociology\n\t+ Criminology\n\t+ Gender, Diversity and Equity Studies\n\t+ Gerontology\n* Certificates:\n\t+ Gerontology\n\t+ Gender, Diversity and Equity Studies\n\n**Sports Studies Program**\n\n* Major in Sports Studies (48 credits)\n* Concentrations:\n\t+ Athletic Development\n\t+ Business and Society\n\t+ Health and Exercise\n* Minor in Sports Studies (24 credits)\n\n**Graduate Programs**\n\n* Master of Education (M.Ed.) in Leadership, Societies, and Languages\n* Master of Arts (M.A.) in Education: Leadership, Societies, and Languages\n* Graduate Certificate in Business\n* Graduate Certificate in Brewing Science\n* Graduate Micro-Program in Climate Change\n* Master's Degree in Computer Science\n* Master's in Physics",
  "Graduate_Studies_MEd_and_MA_in_Education": "Here's a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n- **Graduate Programs in Education**: Explore the Master of Arts (M.A.) and Master of Education (M.Ed.) programs in Education: Leadership, Societies, and Languages.\n- **Program Structure**: Learn about the program structure, including compulsory and elective courses, research modules, and thesis requirements for both M.A. and M.Ed. programs.\n- **Course Offerings**: View the list of graduate courses offered in the M.Ed. and M.A. programs, including topics such as curriculum design, educational research, and educational leadership.",
  "Graduate_Studies_Overview": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n\"Sociology: Explore our undergraduate and graduate programs in Sociology, including majors, minors, and concentrations in Criminology, Family, Health and Community, and Gender, Diversity and Equity Studies. Discover our graduate certificates in Gerontology and Gender, Diversity and Equity Studies. Learn about our research opportunities and faculty expertise in areas such as social inequality, health, and sport studies.\"",
  "Index": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n\"Academic Calendar: Explore academic regulations, programs, and courses, including academic integrity, academic standing, and degree requirements. Find information on admission, application deadlines, and fees, as well as details on graduate studies, certificate programs, and transfer credits. Browse the calendar to learn about academic appeals, course changes, and withdrawals, as well as student services and facilities.\"",
  "Masters_in_Computer_Science": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n* Explore our graduate programs, including Master's degrees in Education, Computer Science, and Physics, as well as graduate certificates in Brewing Science, Climate Change, and Knowledge Mobilization.\n* Our programs offer a range of specializations, from education and climate change to computer science and physics, with courses and research opportunities tailored to your interests and career goals.\n* From thesis-based research to project-based learning, our graduate programs provide a supportive and challenging environment for you to develop your skills and expertise.",
  "Other_Services_and_Facilities": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n\"Services and Facilities\" offers a range of resources and amenities to support student life, including the BU Lounge, Doolittle's Convenience Store, and the Library Learning Commons. The campus also features various cultural and artistic venues, such as the Florence Foreman Art Gallery and the Centennial Theatre. Additionally, students can access support services like the Writing Centre, Mathematics-Statistics Help Centre, and the Student University Centre.",
  "Programs_and_Courses": "Here's a summary of the academic calendar section in 3 sentences for the navigation menu:\n\n- **Academic Calendar**: Learn about the regular hours of the University, course scheduling, and credit requirements.\n- **Course Information**: Understand the course numbering system, credit and hours code, and definitions of terms such as audit, cognate, corequisite, and exemption.\n- **Experiential Learning**: Discover opportunities for experiential learning, including internships, placements, and special topics courses.",
  "Scholarships_Awards_Bursaries_Loans_Prizes": "Here is a summary of the academic calendar section for navigation menu in 3 sentences:\n\nScholarships, Awards, Bursaries, Loans, and Prizes are available to students at Bishop's University. These include entrance scholarships, continuing student scholarships, and renewable scholarships, as well as awards and bursaries for academic achievement, leadership, and community involvement. Students can also apply for government loans and external scholarships, and are eligible for prizes in various departments and programs.",
  "School_of_Education": "To summarize the academic calendar section for the navigation menu in 3 sentences:\n\nThe School of Education offers undergraduate and graduate programs in education, including a Bachelor of Education (B.Ed.) and a Secondary Teacher Education Program, which leads to a B.A. or B.Sc. with a Double Major in Education and a teaching discipline, and a B.Ed. degree. The B.Ed. program requires a minimum of 36 credits in Education at Bishop's University, including practicum components, and a cumulative average of 70% or more. Students who fail to maintain good standing in the School of Education will be required to withdraw from the program and may not be eligible to transfer back into an Education program.",
  "Services_and_Facilities_Overview": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- Student Services: Learn about the mission statement, student conduct, and services offered by the Dean of Student Affairs, including the Co-curricular Record (L.E.A.P. Program) and Ombudsperson.\n- Athletics and Recreation: Discover Bishop's University's athletic programs, facilities, and services, including inter-university athletics, intramural sports, and recreational instructional programs.\n- Student Support Services: Find information on campus resources, including Counselling and Psychological Services, Campus Ministry, Career Counselling Services, and Student Accessibility and Accommodation Services.",
  "Services_Scholarships_Administration_Index": "Based on the provided context, I will summarize the academic calendar section in 3 sentences for use in a navigation menu:\n\n\"Academic Calendar: Explore the academic programs, courses, and regulations at Bishop's University. Find information on admission requirements, academic standing, and graduation procedures. Discover the various departments, faculties, and services available to support student success.\"\n\nHere is the rewritten text in a navigation menu format:\n\n* Academic Programs\n* Admission Requirements\n* Academic Standing\n* Graduation Procedures\n* Departments\n* Faculties\n* Services\n\t+ Student Accessibility & Accommodation Services\n\t+ Athletics and Recreation\n\t+ Art Gallery\n\t+ Book Store\n\t+ Campus Ministry\n\t+ Campus tours\n\t+ Career and Counselling Services\n\t+ Chapel of St.Mark's\n\t+ Clubs, Student\n\t+ Community Art Labs\n\t+ Cormier Centre of International Economics\n\t+ Counselling Services\n\t+ Cultural Affairs\n\t+ Daycare, Panda\n\t+ Disabilities, Student Accessiblity & Accomodation\n\t+ Diversity & Equity Centre\n\t+ Dobson-Lagassé Centre for Entrepreneurship\n\t+ Eastern Townships Resource Centre\n\t+ Financial Aid\n\t+ Health Services\n\t+ Indigenous Support Services\n\t+ Information and Technology Services\n\t+ International Exchange Program\n\t+ International Students\n\t+ LEAP, Leadership & Extra-Curricular Activity Profile\n\t+ Library Learning Commons\n\t+ Mathematics–Statistics Help Centre\n\t+ Off-campus housing\n\t+ Ombudsperson\n\t+ Peer tutoring\n\t+ Recruitment Office\n\t+ Residence Life\n\t+ Sexual Assault Support\n\t+ Sportsmedicine\n\t+ SRC, Students’ Representative Council\n\t+ Student Accessibility & Accommodation Services\n\t+ Student Affairs, Dean of\n\t+ Student government\n\t+ Student University Centre\n\t+ Theatres\n\t+ Wildlife Refuge, Peter D. Curry\n\t+ Writing Centre",
  "Sessional_Dates": "Here's a summary of the academic calendar in 3 sentences for a navigation menu:\n\n- **Sessional Dates 2019-2020**: View key dates for Fall 2019, Winter 2020, Spring I 2020, Spring II 2020, and Summer 2020 semesters, including class start and end dates, holidays, and examination periods.\n- **Fall 2019**: Explore dates for the Fall 2019 semester, including the start of classes for Education students, Labour Day, Thanksgiving Monday, and the end of semester examinations.\n- **Winter 2020 and Beyond**: Find dates for the Winter 2020 semester and subsequent semesters, including the start of classes, reading week, and examination periods for Spring I, Spring II, and Summer 2020.",
  "Student_Services": "Here's a 3-sentence summary of the academic calendar section for the navigation menu:\n\n- Services and Facilities: Find information on various services and facilities, including Peer Tutoring Program, Indigenous Support Services, Sexual Assault Support, Health Services, Residence Life, Off-Campus Housing Service, Academic Facilitation, Student Government and Student Activities.\n- Services and Facilities Location: Marjorie Donald Building, Centennial Building, John H. Price Sports Centre, and Student Union Building.\n- Contact Information: (819) 822-9695, (819) 822-9600, residence@ubishops.ca, offcamp@ubishops.ca, srcpres@ubishops.ca, etc.",
  "University_Regulations": "❌ llama-3.1-8b-instant failed: Can you clarify your question",
  "University_Regulations_and_Programs": "❌ llama-3.1-8b-instant failed: Can you clarify your question",
  "Williams_School_of_Business": "Here is a summary of the academic calendar section in 3 sentences for use in a navigation menu:\n\n- **Programs Overview**: Learn about the Williams School of Business at Bishop's University, including undergraduate degrees, concentrations, and profiles.\n- **Business Programs**: Discover the requirements for admission, course sequences, and concentrations in Business Administration, including Accounting, Finance, Global Management and Leadership, and Marketing and Entrepreneurship.\n- **Academic Advising**: Find information on course sequencing, concentration streams, and profiles, as well as resources for academic advising and support.",
  "Writing_Centre": "Here's a summary of the academic calendar section in 3 sentences for a navigation menu:\n\n- Exemptions from the English Writing Proficiency (EWP) Requirement: Certain students, including those who completed an undergraduate or graduate degree in English, international exchange students, and students in certificate programs, are exempt from the EWP requirement.\n- English Writing Proficiency (EWP) Support: Students can take EWP099 to improve their writing skills, or seek consultation services at The Writing Centre for help with written assignments and exam preparation.\n- Experiential Learning Opportunities: The university offers various experiential learning courses, including internships, labs, and special topics courses, that allow students to apply theoretical knowledge in real-world settings."
}